#######################匯入模組#######################
from tkinter import *
import sys
import os

# * 是匯入模組中所有的函數、類別和變數，這樣就可以直接使用它們而不需要加上模組名稱作為前綴。

#######################設定工作目錄#######################
# 設定工作目錄
os.chdir(sys.path[0])
#######################建立(主)視窗########################
# 創建一個主視窗
window = Tk()

# 設定視窗的標題
window.title("我的第一個視窗")

#######################創建畫布########################
# 創建一個畫布，指定寬度和高度
canvas = Canvas(window, width=600, height=600, bg="white")
# 將畫布放置在視窗中
canvas.pack()

#######################設定視窗圖片########################
# 設定視窗圖片
window.iconbitmap("crocodile2.png")

#######################載入圖片########################
# tkinter 內鍵 PhotoImage 類別用於處理圖像文件，只支援 PNG GIF PGM PPM 格式， 不支援 JPEG 格式。
img = PhotoImage(file="crocodile2.png")

#######################顯示圖片########################
# 在畫布上顯示圖片，指定位置為 (300, 300)，並將圖片的中心對齊
my_img = canvas.create_image(300, 300, image=img)

#######################運行應用程式########################
# 開始執行主迴圈，讓視窗保持顯示並等待用戶的操作
window.mainloop()
