#######################匯入模組#######################
from ttkbootstrap import *

import os
import sys

#######################定義函數########################

#######################建立視窗########################
# 建立主視窗
window = Tk()  # 創建一個 Tkinter 主窗口對象
# 設置窗口標題為 "天氣查詢"
window.title("天氣查詢")  # 設置窗口標題為 "天氣查詢"

#######################設定字形########################
# 設置全域大小
font_style = 20
# 設置全局字體為 Arial，大小為 20
window.option_add("*Font", ("Arial", font_style))

#######################運行應用程式########################
